Repository: suneeshpm/Dukakeen_app
Catalog: lib/l10n/app_*.arb
Languages: ml

# appTitle
source: FinTrack
ml: ഫിൻട്രാക്ക്

# addTransactionTitle
source: Add Transaction
ml: ട്രാൻസാക്ഷൻ ചേർക്കുക

# editTransactionTitle
source: Edit Transaction
ml: ട്രാൻസാക്ഷൻ എഡിറ്റ് ചെയ്യുക

# amountLabel
source: Amount (AED)
ml: തുക (AED)

# categoryLabel
source: Category (e.g., Food, Taxi)
ml: വിഭാഗം (ഉദാ: ഭക്ഷണം, ടാക്സി)

# noteLabel
source: Note (optional)
ml: കുറിപ്പ് (ഐച്ഛികം)

# dateLabel
source: Date
ml: തീയതി

# pickDateButton
source: Pick date
ml: തീയതി തിരഞ്ഞെടുക്കുക

source: Expense
ml: ചെലവ്

source: Income
ml: വരുമാനം

# saveButton
source: Save
ml: സേവ് ചെയ്യുക

# updateButton
source: Update
ml: അപ്‌ഡേറ്റ് ചെയ്യുക

# addButton
source: Add
ml: ചേർക്കുക

# themeMenu
source: Theme mode
ml: തീം മോഡ്

# themeLight
source: Light
ml: ലൈറ്റ്

# themeDark
source: Dark
ml: ഡാർക്ക്

# themeSystem
source: System
ml: സിസ്റ്റം

# noTransactions
source: No transactions yet
ml: ഇതിനുമുമ്പ് ട്രാൻസാക്ഷനുകൾ ഇല്ല

# addFirstTransaction
source: Tap the Add button to record your first expense or income.
ml: നിങ്ങളുടെ ആദ്യ ചെലവോ വരുമാനമോ ചേർക്കാൻ Add ബട്ടൺ ടാപ്പ് ചെയ്യുക.

source: Budget
ml: ബജറ്റ്

source: Spent
ml: ചെലവായത്

source: Remaining
ml: ബാക്കിയുള്ളത്

source: Set budget
ml: ബജറ്റ് നിശ്ചയിക്കുക

source: Edit budget
ml: ബജറ്റ് എഡിറ്റ് ചെയ്യുക

# budgetSet
source: Budget set for this month
ml: ഈ മാസത്തേക്ക് ബജറ്റ് നിശ്ചയിച്ചു

# noBudgetSet
source: No budget set yet
ml: ഇനിയും ബജറ്റ് നിശ്ചയിച്ചിട്ടില്ല

source: Grand total
ml: മൊത്തം തുക

source: Delete
ml: ഡിലീറ്റ് ചെയ്യുക

# amountError
source: Enter an amount
ml: തുക നൽകുക

# positiveAmountError
source: Enter a valid positive amount
ml: സരിയായ പോസിറ്റീവ് തുക നൽകുക

# categoryError
source: Enter a category
ml: ഒരു വിഭാഗം നൽകുക

source: Note
ml: കുറിപ്പ്

source: Edit Note
ml: കുറിപ്പ് എഡിറ്റ് ചെയ്യുക

# typeYourNote
source: Type your note here...
ml: നിങ്ങളുടെ കുറിപ്പ് ഇവിടെ ടൈപ്പ് ചെയ്യുക...

source: Clear
ml: ക്ലിയർ ചെയ്യുക

source: Close
ml: അടയ്ക്കുക

source: Copied to clipboard
ml: ക്ലിപ്പ്ബോർഡിലേക്ക് പകർത്തി

source: Save
ml: സേവ് ചെയ്യുക

source: Cancel
ml: റദ്ദാക്കുക

source: Edit
ml: എഡിറ്റ് ചെയ്യുക

# todayLabel
source: Today
ml: ഇന്ന്

# yesterdayLabel
source: Yesterday
ml: ഇന്നലെ

source: Change language
ml: ഭാഷ മാറ്റുക

# insightsTitle
source: Analytics & Insights
ml: വിശകലനം & ഇൻസൈറ്റ്സ്

# monthSelectorThisMonth
source: This month
ml: ഈ മാസം

# prevMonth
source: Previous
ml: മുൻ മാസം

# nextMonth
source: Next
ml: അടുത്ത മാസം

source: Net
ml: നെറ്റ്

source: By category
ml: വിഭാഗംപ്രകാരം

source: Daily expense trend
ml: ദൈനംദിന ചെലവിന്റെ പ്രവണത

source: Top categories
ml: മികച്ച വിഭാഗങ്ങൾ

# noExpenses
source: No expenses for this month
ml: ഈ മാസത്തിൽ ചെലവുകൾ ഇല്ല

source: No data
ml: ഡാറ്റയില്ല

# byNavas
source: by MOHAMMED NAVAS
ml: മുഹമ്മദ് നവാസ് നിർമ്മിച്ചത്

source: Analytics
ml: വിശകലനം

source: Settings
ml: ക്രമീകരണങ്ങൾ

source: Preferences
ml: ആവശ്യങ്ങൾ

source: Security
ml: സുരക്ഷ

source: About
ml: കുറിച്ച്

source: Change PIN
ml: പിൻ മാറ്റുക

source: Display Currency
ml: പ്രദർശന കറൻസി

source: App Version
ml: ആപ്പ് പതിപ്പ്

# rateApp
source: Rate this App
ml: ആപ്പ് റേറ്റ് ചെയ്യുക

# currencyAed
source: AED - United Arab Emirates Dirham
ml: എ.ഇ.ഡി - യുഎഇ ദിർഹം

# currencyInr
source: INR - Indian Rupee
ml: ഐ.എൻ.ആർ - ഇന്ത്യൻ രൂപ

# currencyUsd
source: USD - US Dollar
ml: യു.എസ്.ഡി - അമേരിക്കൻ ഡോളർ

# currencyEur
source: EUR - Euro
ml: യൂറോ

# currencySar
source: SAR - Saudi Riyal
ml: എസ്.എ.ആർ - സൗദി റിയാൽ

# currencyQar
source: QAR - Qatari Riyal
ml: ക്യു.എ.ആർ - ഖത്തർ റിയാൽ

# currencyOmr
source: OMR - Omani Rial
ml: ഒ.എം.ആർ - ഒമാൻ റിയാൽ

# displayCurrencyUpdated
source: Converted to {currency} · Updated {time}
ml: {currency} ആയി മാറ്റി · പുതുക്കിയത് {time}

# currencyConversionUnavailable
source: Conversion unavailable. Showing original currency.
ml: മാറ്റം ലഭ്യമല്ല. യഥാർത്ഥ കറൻസി പ്രദർശിപ്പിക്കുന്നു.

# setPinTitle
source: Set PIN
ml: പിൻ സജ്ജീകരിക്കുക

# setPinSubtitle
source: Secure your app with a PIN
ml: ആപ്പ് പിൻ ഉപയോഗിച്ച് സുരക്ഷിതമാക്കുക

# setPinDescription
source: Create a 4–6 digit PIN to protect your app.
ml: ആപ്പ് സംരക്ഷിക്കാൻ 4–6 അക്ക പിൻ സൃഷ്ടിക്കുക.

source: Confirm PIN
ml: പിൻ സ്ഥിരീകരിക്കുക

source: Enter PIN
ml: പിൻ നൽകുക

source: Incorrect PIN
ml: തെറ്റായ പിൻ

# pinNotMatch
source: PIN does not match
ml: പിൻ പൊരുത്തപ്പെടുന്നില്ല

# pinTooShort
source: PIN must be at least 4 digits
ml: പിൻ കുറഞ്ഞത് 4 അക്കമെങ്കിലും വേണം

# pinHelper
source: 6 digits
ml: 6 അക്കങ്ങൾ

source: Save PIN
ml: പിൻ സേവ് ചെയ്യുക

# unlockTitle
source: Unlock
ml: അൺലോക്ക്

# unlockSubtitle
source: Enter your 6-digit PIN
ml: നിങ്ങളുടെ 6-അക്ക പിൻ നൽകുക

# unlockButton
source: Unlock
ml: അൺലോക്ക്

source: Use biometrics
ml: ബയോമെട്രിക് ഉപയോഗിക്കുക

# biometricsTitle
source: Biometric Unlock
ml: ബയോമെട്രിക് അൺലോക്ക്

# biometricsEnable
source: Use biometrics to unlock
ml: ആപ്പ് തുറക്കാൻ ബയോമെട്രിക് ഉപയോഗിക്കുക

# biometricsNotAvailable
source: Biometrics not available on this device
ml: ഈ ഉപകരണത്തിൽ ബയോമെട്രിക് ലഭ്യമല്ല

# biometricFailed
source: Biometric authentication failed
ml: ബയോമെട്രിക് സ്ഥിരീകരണം പരാജയപ്പെട്ടു

# themeSelectedLight
source: Light theme applied
ml: ലൈറ്റ് തീം പ്രയോഗിച്ചു

# themeSelectedDark
source: Dark theme applied
ml: ഡാർക്ക് തീം പ്രയോഗിച്ചു

# themeSelectedSystem
source: System theme applied
ml: സിസ്റ്റം തീം പ്രയോഗിച്ചു

# languageChanged
source: Language changed to {lang}
ml: ഭാഷ {lang} ആയി മാറ്റി

# languageEnglish
source: English
ml: ഇംഗ്ലീഷ്

# languageArabic
source: Arabic
ml: അറബിക്

# languageHindi
source: Hindi
ml: ഹിന്ദി

# languageMalayalam
source: Malayalam
ml: മലയാളം

source: Export Data
ml: ഡാറ്റ എക്സ്പോർട്ട് ചെയ്യുക

# exportCsv
source: Export as CSV
ml: CSV ആയി എക്സ്പോർട്ട് ചെയ്യുക

# exportPdf
source: Export as PDF
ml: PDF ആയി എക്സ്പോർട്ട് ചെയ്യുക

source: Backup Data
ml: ഡാറ്റ ബാക്കപ്പ്

source: Restore Data
ml: ഡാറ്റ പുനഃസ്ഥാപിക്കുക

# developedBy
source: Developed by Navaska
ml: Navaska വികസിപ്പിച്ചത്

# versionLabel
source: Version
ml: പതിപ്പ്

# lastUpdated
source: Last updated {date}
ml: അവസാനമായി പുതുക്കിയത് {date}

source: Feedback
ml: പ്രതികരണം
